{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 450]}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "layer_1", "class_name": "Dense", "config": {"trainable": true, "use_bias": true, "units": 450, "name": "layer_1", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"inbound_nodes": [[["layer_1", 0, 0, {"training": true}]]], "name": "dropout_1", "class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "trainable": true, "rate": 0.1, "noise_shape": null}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "layer_2", "class_name": "Dense", "config": {"trainable": true, "use_bias": true, "units": 900, "name": "layer_2", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"inbound_nodes": [[["layer_2", 0, 0, {"training": true}]]], "name": "dropout_2", "class_name": "Dropout", "config": {"seed": null, "name": "dropout_2", "trainable": true, "rate": 0.1, "noise_shape": null}}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "layer_3", "class_name": "Dense", "config": {"trainable": true, "use_bias": true, "units": 450, "name": "layer_3", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"inbound_nodes": [[["layer_3", 0, 0, {"training": true}]]], "name": "dropout_3", "class_name": "Dropout", "config": {"seed": null, "name": "dropout_3", "trainable": true, "rate": 0.1, "noise_shape": null}}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "layer_4", "class_name": "Dense", "config": {"trainable": true, "use_bias": true, "units": 100, "name": "layer_4", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"inbound_nodes": [[["layer_4", 0, 0, {"training": true}]]], "name": "dropout_4", "class_name": "Dropout", "config": {"seed": null, "name": "dropout_4", "trainable": true, "rate": 0.1, "noise_shape": null}}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "layer_5", "class_name": "Dense", "config": {"trainable": true, "use_bias": true, "units": 100, "name": "layer_5", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"inbound_nodes": [[["layer_5", 0, 0, {"training": true}]]], "name": "dropout_5", "class_name": "Dropout", "config": {"seed": null, "name": "dropout_5", "trainable": true, "rate": 0.1, "noise_shape": null}}, {"inbound_nodes": [[["dropout_5", 0, 0, {}]]], "name": "layer_6", "class_name": "Dense", "config": {"trainable": true, "use_bias": true, "units": 100, "name": "layer_6", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}], "name": "model_3", "output_layers": [["layer_6", 0, 0]], "input_layers": [["input_1", 0, 0]]}}, {"class_name": "Dense", "config": {"dtype": "float32", "trainable": true, "use_bias": true, "units": 100, "name": "dense_5", "batch_input_shape": [null, 450], "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "units": 100, "name": "dense_6", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "units": 100, "name": "dense_7", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "units": 5, "name": "dense_8", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "softmax", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}]}