{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Model", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 450]}}, {"class_name": "Dense", "name": "layer_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"trainable": false, "use_bias": true, "units": 450, "name": "layer_1", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["layer_1", 0, 0, {"training": true}]]], "config": {"seed": null, "name": "dropout_1", "trainable": false, "rate": 0.1, "noise_shape": null}}, {"class_name": "Dense", "name": "layer_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"trainable": false, "use_bias": true, "units": 900, "name": "layer_2", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Dropout", "name": "dropout_2", "inbound_nodes": [[["layer_2", 0, 0, {"training": true}]]], "config": {"seed": null, "name": "dropout_2", "trainable": false, "rate": 0.1, "noise_shape": null}}, {"class_name": "Dense", "name": "layer_3", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"trainable": false, "use_bias": true, "units": 450, "name": "layer_3", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Dropout", "name": "dropout_3", "inbound_nodes": [[["layer_3", 0, 0, {"training": true}]]], "config": {"seed": null, "name": "dropout_3", "trainable": false, "rate": 0.1, "noise_shape": null}}, {"class_name": "Dense", "name": "layer_4", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"trainable": false, "use_bias": true, "units": 100, "name": "layer_4", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Dropout", "name": "dropout_4", "inbound_nodes": [[["layer_4", 0, 0, {"training": true}]]], "config": {"seed": null, "name": "dropout_4", "trainable": false, "rate": 0.1, "noise_shape": null}}, {"class_name": "Dense", "name": "layer_5", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"trainable": false, "use_bias": true, "units": 100, "name": "layer_5", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Dropout", "name": "dropout_5", "inbound_nodes": [[["layer_5", 0, 0, {"training": true}]]], "config": {"seed": null, "name": "dropout_5", "trainable": false, "rate": 0.1, "noise_shape": null}}, {"class_name": "Dense", "name": "layer_6", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "config": {"trainable": false, "use_bias": true, "units": 100, "name": "layer_6", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Dense", "name": "newlast", "inbound_nodes": [[["layer_6", 0, 0, {}]]], "config": {"trainable": true, "use_bias": true, "units": 5, "name": "newlast", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "softmax", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}], "output_layers": [["newlast", 0, 0]], "input_layers": [["input_1", 0, 0]]}}